Autodesk.Revit.DB.FolderItemInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FolderItemInfo.Name
The folder name
Since:
2015

Autodesk.Revit.DB.FolderItemInfo.ElementId
The folder parameter Id
Since:
2015

Autodesk.Revit.DB.FolderItemInfo
Contains data for each folder item in the organization settings of the project browser including folder parameter Id and folder name.
Remarks:
FolderItemInfo is the return value of BrowserOrganization.GetFolderItems().
Since:
2015